reports/mysql-coupon-loadtest/runs/diag2-n100-500rps-003/k6-console.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/coupon-arrival-rate.js
        output: -

     scenarios: (100.00%) 1 scenario, 6000 max VUs, 40s max duration (incl. graceful stop):
              * unique_member_first_request: 500.00 iterations/s for 10s (maxVUs: 3000-6000, gracefulStop: 30s)


running (00.6s), 0071/3000 VUs, 208 complete and 0 interrupted iterations
unique_member_first_request   [   6% ] 0071/3000 VUs  00.6s/10s  500.00 iters/s

running (01.6s), 0380/3000 VUs, 398 complete and 0 interrupted iterations
unique_member_first_request   [  16% ] 0380/3000 VUs  01.6s/10s  500.00 iters/s

running (02.6s), 0809/3000 VUs, 469 complete and 0 interrupted iterations
unique_member_first_request   [  26% ] 0809/3000 VUs  02.6s/10s  500.00 iters/s

running (03.6s), 1052/3000 VUs, 725 complete and 0 interrupted iterations
unique_member_first_request   [  36% ] 1052/3000 VUs  03.6s/10s  500.00 iters/s

running (04.6s), 1112/3000 VUs, 1167 complete and 0 interrupted iterations
unique_member_first_request   [  46% ] 1112/3000 VUs  04.6s/10s  500.00 iters/s

running (05.6s), 0752/3000 VUs, 2027 complete and 0 interrupted iterations
unique_member_first_request   [  56% ] 0752/3000 VUs  05.6s/10s  500.00 iters/s

running (06.6s), 0449/3000 VUs, 2830 complete and 0 interrupted iterations
unique_member_first_request   [  66% ] 0449/3000 VUs  06.6s/10s  500.00 iters/s

running (07.6s), 0098/3000 VUs, 3680 complete and 0 interrupted iterations
unique_member_first_request   [  76% ] 0098/3000 VUs  07.6s/10s  500.00 iters/s

running (08.6s), 0004/3000 VUs, 4274 complete and 0 interrupted iterations
unique_member_first_request   [  86% ] 0004/3000 VUs  08.6s/10s  500.00 iters/s

running (09.6s), 0008/3000 VUs, 4771 complete and 0 interrupted iterations
unique_member_first_request   [  96% ] 0008/3000 VUs  09.6s/10s  500.00 iters/s


  █ TOTAL RESULTS 

    checks_total.......: 5000    497.182007/s
    checks_succeeded...: 100.00% 5000 out of 5000
    checks_failed......: 0.00%   0 out of 5000

    ✓ business response or no server error

    CUSTOM
    coupon_issue_business_response_under_2s...: 84.08% 4204 out of 5000
    coupon_issue_issued.......................: 5000   497.182007/s

    HTTP
    http_req_duration.........................: avg=929.12ms min=4.29ms med=718.84ms max=4.49s p(90)=2.19s p(95)=2.42s p(99)=3.14s
      { expected_response:true }..............: avg=929.12ms min=4.29ms med=718.84ms max=4.49s p(90)=2.19s p(95)=2.42s p(99)=3.14s
    http_req_failed...........................: 0.00%  0 out of 5000
    http_reqs.................................: 5000   497.182007/s

    EXECUTION
    iteration_duration........................: avg=941.66ms min=5.33ms med=728.33ms max=4.51s p(90)=2.21s p(95)=2.49s p(99)=3.18s
    iterations................................: 5000   497.182007/s
    vus.......................................: 8      min=5            max=1112
    vus_max...................................: 3000   min=3000         max=3000

    NETWORK
    data_received.............................: 1.2 MB 117 kB/s
    data_sent.................................: 1.6 MB 157 kB/s



running (10.1s), 0000/3000 VUs, 5000 complete and 0 interrupted iterations
unique_member_first_request ✓ [ 100% ] 0000/3000 VUs  10s  500.00 iters/s